In [1]:
import pandas as pd
df  = pd.read_csv('salaries.csv')
df.head()

  company                  job     degree  salary_more_then_100k
0  google      sales executive  bachelors                      0
1  google      sales executive    masters                      0
2  google     business manager  bachelors                      1
3  google     business manager    masters                      1
4  google  computer programmer  bachelors                      0

In [2]:
inputs = df.drop('salary_more_then_100k', axis = 'columns')
target = df['salary_more_then_100k']

In [3]:
from sklearn.preprocessing import LabelEncoder

In [4]:
le_company = LabelEncoder()
le_job = LabelEncoder()
le_degree = LabelEncoder()

In [5]:
inputs['company_n'] = le_company.fit_transform(inputs['company'])
inputs['job_n'] = le_company.fit_transform(inputs['job'])
inputs['degree_n'] = le_company.fit_transform(inputs['degree'])

In [6]:
inputs_n = inputs.drop(['company', 'job', 'degree'], axis = 'columns')
inputs_n

    company_n  job_n  degree_n
0           2      2         0
1           2      2         1
2           2      0         0
3           2      0         1
4           2      1         0
5           2      1         1
6           0      2         1
7           0      1         0
8           0      0         0
9           0      0         1
10          1      2         0
11          1      2         1
12          1      0         0
13          1      0         1
14          1      1         0
15          1      1         1

In [7]:
from sklearn import tree

In [8]:
model = tree.DecisionTreeClassifier()

In [9]:
model.fit(inputs_n,target)

DecisionTreeClassifier()

In [10]:
model.score(inputs_n, target)

1.0

In [11]:
model.predict([[2,2,1]])  # working in Google as Sales executive with a Masters degree

C:\Users\Pruthvik Kashyap S\anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but DecisionTreeClassifier was fitted with feature names
  warnings.warn(

array([0], dtype=int64)

In [12]:
# Exercise

In [13]:
import pandas as pd
from sklearn import tree
from sklearn.preprocessing import LabelEncoder
from sklearn.model_selection import train_test_split

In [14]:
df = pd.read_csv('titanic.csv')
df.head()
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [15]:
df.drop(['PassengerId', 'Name', 'SibSp','Parch', 'Ticket', 'Cabin', 'Embarked'], axis = 1, inplace = True) 
df.Age = df.Age.fillna(df.Age.mean())
df

     Survived  Pclass     Sex        Age     Fare
0           0       3    male  22.000000   7.2500
1           1       1  female  38.000000  71.2833
2           1       3  female  26.000000   7.9250
3           1       1  female  35.000000  53.1000
4           0       3    male  35.000000   8.0500
..        ...     ...     ...        ...      ...
886         0       2    male  27.000000  13.0000
887         1       1  female  19.000000  30.0000
888         0       3  female  29.699118  23.4500
889         1       1    male  26.000000  30.0000
890         0       3    male  32.000000   7.7500

[891 rows x 5 columns]

In [16]:
target = df['Survived']
target.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [17]:
df.drop('Survived', axis = 1, inplace = True)
df.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [18]:
le_sex = LabelEncoder()

In [19]:
df['sex_n'] = le_sex.fit_transform(df['Sex'])

In [20]:
df.drop('Sex', axis=1, inplace = True)

In [21]:

X_train, X_test,y_train, y_test = train_test_split(df, target, test_size = 0.05)
X_train

     Pclass        Age     Fare  sex_n
298       1  29.699118  30.5000      1
526       2  50.000000  10.5000      0
116       3  70.500000   7.7500      1
139       1  24.000000  79.2000      1
501       3  21.000000   7.7500      0
..      ...        ...      ...    ...
229       3  29.699118  25.4667      0
273       1  37.000000  29.7000      1
710       1  24.000000  49.5042      0
3         1  35.000000  53.1000      0
757       2  18.000000  11.5000      1

[846 rows x 4 columns]

In [22]:
model = tree.DecisionTreeClassifier()

In [23]:
model.fit(X_train,y_train)

DecisionTreeClassifier()

In [24]:
model.score(X_test, y_test)

0.7555555555555555

In [25]:
model.predict([[1,30,25,0]])

C:\Users\Pruthvik Kashyap S\anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but DecisionTreeClassifier was fitted with feature names
  warnings.warn(

array([1], dtype=int64)